src/cf/InformationRegisters/ДанныеПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоУниверсальныйДокумент</Name>
					<Comment>УПД, УКД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоКорректировочныйДокумент</Name>
					<Comment>УКД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПокупок</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемИПередачаВРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеНулевойСтавкиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейРаздела7ДекларацииНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеОплатыНДСВБюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПродаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНДСКВычету</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыПриИмпорте</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнымКартам</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/СтраныМира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтраныМира</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАльфа2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАльфа3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастникЕАЭС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/СервисСверкиРасчетовПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает наименование операции для целей сверки расчетов по типу документа и дополнительным сведениям
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - ссылка на документ для которого требуется определить наименование операции
//  ДополнительныеСведения - Структура - ключи определяются конфигурацией-потребителем для точного определения операции
//
// Возвращаемое значение:
//  Строка - наименование операции для целей сопоставления документов
//           на сервисе сверки, см. Перечисления.СервисСверкиРасчетовВидыОпераций
//
Функция НаименованиеОперации(ДокументСсылка, ДополнительныеСведения) Экспорт
	
	Возврат СервисСверкиРасчетовУНФ.НаименованиеОперации(ДокументСсылка, ДополнительныеСведения);
	
КонецФункции

// Возвращает структуру дополнительных сведений, необходимых для определение наименования операции
//
// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса
//
// Возвращаемое значение:
//  Структура - ключи определяются конфигурацией-потребителем для точного определения операции:
//  * ВидОперации - ПеречислениеСсылка - вид операции документа.
//
Функция ДополнительныеСведенияДляОпределенияОперации(Выборка) Экспорт
	
	Возврат СервисСверкиРасчетовУНФ.ДополнительныеСведенияДляОпределенияОперации(Выборка);
	
КонецФункции

// Получает сведения к отправке по документам для сверки.
//
// Параметры:
//  ДатаНачала - Дата - дата, начиная с которой нужно получить сведения
//  ДатаОкончания - Дата - дата по которую нужно получить сведения
//
// Возвращаемое значение:
//  РезультатЗапроса - пример запроса:
//
//  "ВЫБРАТЬ
//  |	ВТ_ДанныеРеестра.Организация КАК Организация,
//  |	ВТ_ДанныеРеестра.Контрагент КАК Контрагент,
//  |	ВТ_ДанныеРеестра.Документ КАК Документ,
//  |	ВТ_ДанныеРеестра.ИдентификаторДокумента КАК ИдентификаторДокумента,
//  |	ВТ_ДанныеРеестра.Статус КАК Статус,
//  |	ЕСТЬNULL(ВТ_ДанныеРеестра.НомерДокумента, """") КАК НомерДокумента,
//  |	ЕСТЬNULL(ВТ_ДанныеРеестра.ДатаДокумента, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДокумента,
//  |	ЕСТЬNULL(ВТ_ДанныеРеестра.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистратора,
//  |	ЕСТЬNULL(ВТ_ДанныеРеестра.НомерРегистратора, """") КАК НомерРегистратора,
//  |	ВТ_ДанныеРеестра.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
//  |	Организации.ИНН КАК ИНН,
//  |	ВЫБОР
//  |		КОГДА Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
//  |			ТОГДА Организации.КПП
//  |		ИНАЧЕ """"
//  |	КОНЕЦ КАК КПП,
//  |	Организации.НаименованиеПолное КАК НаименованиеПолное,
//  |	СУММА(ВТ_ДанныеРеестра.Дебет - ВТ_ДанныеРеестра.Кредит) КАК Сумма,
//  |	Организации.Наименование КАК Наименование,
//  |	ВТ_ДанныеРеестра.ЦифровойИндексОбособленногоПодразделения КАК ЦифровойИндексОбособленногоПодразделения,
//  |	МАКСИМУМ(ВТ_ДанныеРеестра.Счет) КАК Счет,
//  |	МАКСИМУМ(ВТ_ДанныеРеестра.ВидПрочихДоходовИРасходов) КАК ВидПрочихДоходовИРасходов,
//  |	СУММА(ВЫБОР
//  |			КОГДА ВТ_ДанныеРеестра.ВалютнаяСумма < 0
//  |				ТОГДА -ВТ_ДанныеРеестра.ВалютнаяСумма
//  |			ИНАЧЕ ВТ_ДанныеРеестра.ВалютнаяСумма
//  |		КОНЕЦ) КАК ВалютнаяСумма,
//  |	ВТ_ДанныеРеестра.Валюта КАК Валюта,
//  |	МАКСИМУМ(ВТ_ДанныеРеестра.КорСубконто3) КАК КорСубконто3,
//  |	МАКСИМУМ(ВТ_ДанныеРеестра.КорСубконто2) КАК КорСубконто2,
//  |	МАКСИМУМ(ВТ_ДанныеРеестра.КорСубконто1) КАК КорСубконто1,
//  |	МАКСИМУМ(ВТ_ДанныеРеестра.КорСчет) КАК КорСчет,
//  |	ВТ_ДанныеРеестра.ЭтоКорректировочныйДокумент КАК ЭтоКорректировочныйДокумент,
//  |	ВТ_ДанныеРеестра.ЭтоУниверсальныйДокумент КАК ЭтоУниверсальныйДокумент,
//  |	ВТ_ДанныеРеестра.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
//  |	ВТ_ДанныеРеестра.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
//  |	СУММА(ВТ_ДанныеРеестра.Кредит) КАК Кредит,
//  |	СУММА(ВТ_ДанныеРеестра.Дебет) КАК Дебет,
//  |	ЕСТЬNULL(ВТ_ДанныеПоНДС.НомерСчетаФактуры, """") КАК НомерСчетаФактуры,
//  |	ЕСТЬNULL(ВТ_ДанныеПоНДС.ДатаСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСчетаФактуры,
//  |	ЕСТЬNULL(ВТ_ДанныеПоНДС.ЭтоКорректировочныйСчетФактура, ЛОЖЬ) КАК ЭтоКорректировочныйСчетФактура,
//  |	МАКСИМУМ(ЕСТЬNULL(ВТ_ДанныеПоНДС.СуммаНДС + ВТ_ДанныеПоНДС.СуммаНДСРазницаУменьшение + ВТ_ДанныеПоНДС.СуммаНДСРазницаУвеличение, 0)) КАК СуммаНДС,
//  |	ВТ_ДанныеРеестра.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента,
//  |	ВТ_ДанныеРеестра.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
//  |	ВТ_ДанныеРеестра.НаименованиеКонтрагентаПолное КАК НаименованиеКонтрагентаПолное,
//  |	ВТ_ДанныеРеестра.ИННКонтрагента КАК ИННКонтрагента,
//  |	ВТ_ДанныеРеестра.КППКонтрагента КАК КППКонтрагента,
//  |	ВЫБОР
//  |		КОГДА ЕСТЬNULL(ВТ_ДанныеПоНДС.НомерСчетаФактуры, """") ПОДОБНО ""%[А-Я]%""
//  |			ТОГДА ИСТИНА
//  |		ИНАЧЕ ЛОЖЬ
//  |	КОНЕЦ КАК ОбрабатыватьНомерСФ
//  |ИЗ
//  |	ВТ_ДанныеРеестра КАК ВТ_ДанныеРеестра
//  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
//  |		ПО ВТ_ДанныеРеестра.Организация = Организации.Ссылка
//  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоНДС КАК ВТ_ДанныеПоНДС
//  |		ПО ВТ_ДанныеРеестра.Документ = ВТ_ДанныеПоНДС.ДокументОснование
//  |ГДЕ
//  |	(&ЗаВесьПериод
//  |			ИЛИ ВТ_ДанныеРеестра.ДатаДокумента >= &ДатаНачала
//  |				И ВТ_ДанныеРеестра.ДатаДокумента <= &ДатаОкончания)
//  |
//  |СГРУППИРОВАТЬ ПО
//  |	ВТ_ДанныеРеестра.Организация,
//  |	ВТ_ДанныеРеестра.Контрагент,
//  |	ВТ_ДанныеРеестра.Документ,
//  |	ВТ_ДанныеРеестра.ИдентификаторДокумента,
//  |	ВТ_ДанныеРеестра.Статус,
//  |	ВТ_ДанныеРеестра.ИдентификаторОрганизации,
//  |	Организации.ИНН,
//  |	ВЫБОР
//  |		КОГДА Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
//  |			ТОГДА Организации.КПП
//  |		ИНАЧЕ """"
//  |	КОНЕЦ,
//  |	Организации.НаименованиеПолное,
//  |	Организации.Наименование,
//  |	ВТ_ДанныеРеестра.ЦифровойИндексОбособленногоПодразделения,
//  |	ВТ_ДанныеРеестра.Валюта,
//  |	ВТ_ДанныеРеестра.ЭтоКорректировочныйДокумент,
//  |	ВТ_ДанныеРеестра.ЭтоУниверсальныйДокумент,
//  |	ВТ_ДанныеРеестра.ДатаВходящегоДокумента,
//  |	ВТ_ДанныеРеестра.НомерВходящегоДокумента,
//  |	ЕСТЬNULL(ВТ_ДанныеРеестра.НомерДокумента, """"),
//  |	ЕСТЬNULL(ВТ_ДанныеРеестра.ДатаДокумента, ДАТАВРЕМЯ(1, 1, 1)),
//  |	ЕСТЬNULL(ВТ_ДанныеПоНДС.НомерСчетаФактуры, """"),
//  |	ЕСТЬNULL(ВТ_ДанныеПоНДС.ДатаСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)),
//  |	ЕСТЬNULL(ВТ_ДанныеПоНДС.ЭтоКорректировочныйСчетФактура, ЛОЖЬ),
//  |	ЕСТЬNULL(ВТ_ДанныеРеестра.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)),
//  |	ЕСТЬNULL(ВТ_ДанныеРеестра.НомерРегистратора, """"),
//  |	ВТ_ДанныеРеестра.ИдентификаторКонтрагента,
//  |	ВТ_ДанныеРеестра.НаименованиеКонтрагента,
//  |	ВТ_ДанныеРеестра.НаименованиеКонтрагентаПолное,
//  |	ВТ_ДанныеРеестра.ИННКонтрагента,
//  |	ВТ_ДанныеРеестра.КППКонтрагента,
//  |	ВЫБОР
//  |		КОГДА ЕСТЬNULL(ВТ_ДанныеПоНДС.НомерСчетаФактуры, """") ПОДОБНО ""%[А-Я]%""
//  |			ТОГДА ИСТИНА
//  |		ИНАЧЕ ЛОЖЬ
//  |	КОНЕЦ
//  |ИТОГИ
//  |	МАКСИМУМ(ИдентификаторОрганизации),
//  |	МАКСИМУМ(ИНН),
//  |	МАКСИМУМ(КПП),
//  |	МАКСИМУМ(НаименованиеПолное),
//  |	МАКСИМУМ(Наименование)
//  |ПО
//  |	Организация";
//
Функция ДанныеИнформационнойБазыКСверке(ДатаНачала = '00010101', ДатаОкончания = '00010101') Экспорт
	
	Возврат СервисСверкиРасчетовУНФ.ДанныеИнформационнойБазыКСверке(ДатаНачала, ДатаОкончания);
	
КонецФункции

// Возвращает данные из хранилища.
//
// Параметры:
//  Владелец    - ПланОбменаСсылка, СправочникСсылка, Строка - ссылка на объект информационной базы.
//  Ключ       - Строка - Содержит список имен сохраненных данных, указанных через запятую.
// 
// Возвращаемое значение:
//  Произвольный, Структура, Неопределено - Данные из хранилища. Если указан один ключ,
//                            то возвращается его значение, иначе структура.
//                            Если данные отсутствуют - Неопределено.
//
Функция ПрочитатьДанныеИзХранилища(Владелец, Ключ) Экспорт
	
	Возврат ОбщегоНазначенияПереопределяемый.ПрочитатьДанныеИзХранилища(Владелец, Ключ);
	
КонецФункции

// Записывает данные в хранилище.
//
// Параметры:
//  Владелец - ПланОбменаСсылка, СправочникСсылка, Строка - ссылка на объект информационной базы.
//
//  Данные  - Произвольный - Данные помещаемые хранилище. Неопределено - удаляет все данные.
//             Для удаления данных по ключу следует использовать процедуру УдалитьДанныеИзХранилища.
//  Ключ    - Строка       - Ключ сохраняемых настроек
//                           Ключ должен соответствовать правилам, установленным для идентификаторов:
//                           Первым символом ключа должна быть буква или символ подчеркивания (_).
//                           Каждый из последующих символов может быть буквой, цифрой или символом подчеркивания (_).
//
Процедура ЗаписатьДанныеВХранилище(Владелец, Данные, Ключ) Экспорт
	
	ОбщегоНазначенияПереопределяемый.ЗаписатьДанныеВХранилище(Владелец, Данные, Ключ);
	
КонецПроцедуры

// Ищет контрагента по связке ИНН/КПП, заполняет структуру сведений о контрагенте
//
// Параметры:
//  РеквизитыКонтрагента - Структура:
//  * ИНН - число - ИНН контрагента
//  * КПП - число - КПП контрагента
//  СведенияОКонтрагенте - Структура:
//  * ИНН - число - заполняется, когда не найден по ИНН
//  * КПП - число - заполняется, когда не найден по КПП
//    Значение - ссылка на справочник, если не найден, то пустая ссылка
//
Процедура СведенияКонтрагентаПоИНН_КПП(РеквизитыКонтрагента, СведенияОКонтрагенте) Экспорт
	
	СервисСверкиРасчетовУНФ.СведенияКонтрагентаПоИНН_КПП(РеквизитыКонтрагента, СведенияОКонтрагенте);
	
КонецПроцедуры

// Устанавливает права служебного пользователя для сверки расчетов.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь, для которого необходимо установить права.
//
Процедура УстановитьПраваСлужебногоПользователяСверкиРасчетов(Пользователь) Экспорт
	
	УправлениеДоступомУНФ.УстановитьПраваСлужебногоПользователяСверкиРасчетов(Пользователь);
	
КонецПроцедуры

// Проверяет нужно ли оповещать пользователя о расхождениях.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - ссылка на пользователя, которого нужно проверить на необходимость оповестить
//
// Возвращаемое значение:
//   Булево - признак того, что указанного пользователя нужно оповещать о расхождениях.
//
Функция ОповещатьПользователяОРасхождениях(Пользователь) Экспорт
	
	Возврат СервисСверкиРасчетовУНФ.ОповещатьПользователяОРасхождениях(Пользователь);
	
КонецФункции

// Возвращает организации, которые нужно подключить к сверке.
//
// Параметры:
//  ТолькоСДвижениями - булево - признак того, что нужно регистрировать только те организации
//  по которым есть движения/документы.
//
// Возвращаемое значение:
//   Массив из СправочникСсылка.Организации - массив организаций для подключения.
//
Функция ОрганизацииДляПодключения(ТолькоСДвижениями = Ложь) Экспорт
	
	Возврат СервисСверкиРасчетовУНФ.ОрганизацииДляПодключения(ТолькоСДвижениями);
	
КонецФункции

// Регистрирует документы к сверке с даты начала работы сверки расчетов (см. СервисСверкиРасчетов.ДатаНачалаСверкиРасчетов)
//
// Параметры:
//  МассивОрганизаций  - массив из СправочникСсылка.Организации - если передан, регистрируются документы только указанных организаций.
//  МассивКонтрагентов - массив из СправочникСсылка.Контрагенты - если передан, регистрируются документы только указанных контрагентов.
//
Процедура ЗарегистрироватьКСверкеРанееВведенныеДокументы(МассивОрганизаций, МассивКонтрагентов) Экспорт
	
	СервисСверкиРасчетовУНФ.ЗарегистрироватьКСверкеРанееВведенныеДокументы(МассивОрганизаций, МассивКонтрагентов);
	
КонецПроцедуры

// Возвращает признак того, что документ является счетом-фактурой.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - документ, который проверяется на соответствие типу счета-фактуры.
//
// Возвращаемое значение:
//  Булево - признак того, что документ является счетом-фактурой.
//
Функция ЭтоСчетФактура(ДокументОбъект) Экспорт
	
	Возврат СервисСверкиРасчетовУНФ.ЭтоСчетФактура(ДокументОбъект);
	
КонецФункции

// Регистрирует основания счета-фактуры к обмену. Сам счет-фактура не регистрируется к обмену,
// сведения о счете-фактуре отправляются вместе со сведениями об основании.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - документ-основание счета-фактуры.
//
Процедура ЗарегистрироватьОснованияСФКОбмену(ДокументОбъект) Экспорт
	
	СервисСверкиРасчетовУНФ.ЗарегистрироватьОснованияСФКОбмену(ДокументОбъект);
	
КонецПроцедуры

// Удаляет повторяющиеся элементы массива.
//
// Параметры:
//  ОбрабатываемыйМассив - Массив из Произвольный - элементы произвольных типов, из которых удаляются неуникальные.
//
// Возвращаемое значение:
//   Массив из Произвольный - элементы ОбрабатываемыйМассив после удаления лишних.
//
Функция УдалитьПовторяющиесяЭлементыМассива(ОбрабатываемыйМассив) Экспорт
	
	Возврат ОбщегоНазначенияПереопределяемый.УдалитьПовторяющиесяЭлементыМассива(ОбрабатываемыйМассив);
	
КонецФункции

// Возвращает сведения для регистрации организации на сервисе сверки.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - ссылка на организацию, которую требуется зарегистрировать на сервисе
//  Период - Дата - дата получения сведений по организации
//
// Возвращаемое значение:
//  Структура:
//   * Представление - Строка
//   * ПолноеНаименование - Строка
//   * КодПоОКПО - Строка - код по ОКПО,
//   * ИНН - Строка - ИНН,
//   * КПП - Строка - КПП,
//   * Телефоны - Строка - телефоны,
//   * ЮридическийАдрес - Строка - представление юридического адреса,
//   * ФактическийАдрес - Строка - представление фактического адреса,
//   * ПочтовыйАдрес - Строка - представление почтового адреса,
//   * ЭлектроннаяПочта - Строка - представление электронной почты,
//   * Факс - Строка - представление факса,
//   * Банк - Строка - представление банка,
//   * БИК - Строка - БИК банка,
//   * АдресБанка - Строка - адрес банка,
//   * КоррСчет - Строка - корреспондентский счет банка,
//   * НомерСчета - Строка - номер счета,
//   * ТекстКорреспондента - Строка - текст корреспондента,
//   * Свидетельство - Строка - представление свидетельства,
//   * СвидетельствоСерияНомер - Строка - серия и номер свидетельства,
//   * СвидетельствоДатаВыдачи - Строка - дата выдачи свидетельства,
//   * СтранаРегистрации - Строка - страна регистрации,
//   * ВидКонтрагента - Строка - вид контрагента,
//   * РегистрационныйНомер - Строка - регистрационный номер,
//   * СокращенноеНаименование - Строка - сокращенное наименование
//   * НаименованиеДляПечати - Строка - наименование для печати
//   * НаименованиеДляПечатныхФорм - Строка
//   * ЮридическоеФизическоеЛицо - ПеречислениеСсылка.ЮридическоеФизическоеЛицо
//   * ДолжностьРуководителяПредставление - Строка
//   * Руководитель - Строка
//   * ФИОФизлица - Строка
//   * Email - Строка
//
Функция СведенияОЮрФизЛице(Организация, Период = '00010101') Экспорт
	
	Результат = ПечатьДокументовУНФ.СведенияОЮрФизЛице(Организация, Период);
	
	// Дополним сведения об организации полями, отсутствующими в типовой функции УНФ СведенияОЮрФизЛице()
	СтруктураОтветственных =
		УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ОтветственныеЛицаОрганизационнойЕдиницы(Организация);
	Результат.Вставить("ДолжностьРуководителяПредставление", Строка(СтруктураОтветственных.ДолжностьРуководителя));	
	Результат.Вставить("Руководитель", СтруктураОтветственных.РасшифровкаПодписиРуководителя);	
	Результат.Вставить("НаименованиеДляПечатныхФорм", Результат.НаименованиеДляПечати);
	Результат.Вставить("Email", Результат.ЭлектроннаяПочта);
	ЮридическоеФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮридическоеФизическоеЛицо");
	Результат.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
	Если ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		Результат.Вставить("ФИОФизлица", Результат.НаименованиеДляПечати);	
	КонецЕсли;
	//
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользоватьНесколькоОрганизаций() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций")
		И Справочники.Организации.КоличествоОрганизаций() > 1;
	
КонецФункции

Функция НастройкаОбсужденийДоступна() Экспорт
	
	Возврат ПравоДоступа("АдминистрированиеДанных", Метаданные);
	
КонецФункции

Функция ОрганизацияПоУмолчанию() Экспорт
	
	Возврат Справочники.Организации.ОрганизацияПоУмолчанию();
	
КонецФункции

// Реквизиты организации для подключения.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - Организация
// 
// Возвращаемое значение:
//  Структура - Реквизиты организации для подключения:
// * Наименование - Строка - Наименование организации
// * ЭтоЮрЛицо - Булево - Признак юрлица
//
Функция РеквизитыОрганизацииДляПодключения(Организация) Экспорт
	
	РеквизитыОрганизацииДляПодключения = Новый Структура;
	РеквизитыОрганизацииДляПодключения.Вставить("Наименование",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "Наименование"));
	РеквизитыОрганизацииДляПодключения.Вставить("ЭтоЮрЛицо", Справочники.Организации.ЭтоЮрЛицо(Организация));
	
	Возврат РеквизитыОрганизацииДляПодключения;
	
КонецФункции

Функция ЭтоПолныйИнтерфейс() Экспорт
	
	Возврат Истина;	
	
КонецФункции

// Контрагент подлежит сверке.
// 
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Контрагент
// 
// Возвращаемое значение:
//  Булево - Контрагент подлежит сверке
//
Функция КонтрагентПодлежитСверке(Контрагент) Экспорт
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ИННВведенКорректно") = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Справочники.Контрагенты.ЭтоИностраннаяОрганизация(Контрагент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ДанныеПервичногоДокумента(ДокументСсылка) Экспорт
	
	Возврат РегистрыСведений.ДанныеПервичныхДокументов.ДанныеПервичногоДокумента(ДокументСсылка);
	
КонецФункции

Функция КонтрагентыДляСверки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ПометкаУдаления
	|	И Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|	И Контрагенты.ИННВведенКорректно
	|	И ВЫБОР
	|			КОГДА Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
	|				ТОГДА Контрагенты.КППВведенКорректно
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	ТаблицаКонтрагенты = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаКонтрагенты.ВыгрузитьКолонку("Контрагент");
	
КонецФункции

Процедура ИнициализацияКомпоновщикаНастроек(Форма, ОрганизацияИзменилась = Ложь, ИмяВариантаНастроек = "") Экспорт
	
	СервисСверкиРасчетовУНФ.ИнициализацияКомпоновщикаНастроек(Форма, ОрганизацияИзменилась = Ложь, ИмяВариантаНастроек = "");
	
КонецПроцедуры

Процедура ОтчетПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Форма.ДанныеРасшифровки = ПоместитьВоВременноеХранилище(Форма.ДанныеРасшифровки, Форма.УникальныйИдентификатор);

КонецПроцедуры

Процедура ЗаполнитьСписокОрганизаций(ЭлементПолеОрганизация, СоответствиеОрганизаций, Период = '00010101', ИсключитьФилиалы = Ложь) Экспорт
	
	УчетНДСПереопределяемый.ЗаполнитьСписокОрганизаций(ЭлементПолеОрганизация, СоответствиеОрганизаций);	
	
КонецПроцедуры 

Процедура ОбработкаРезультатаОтчета(ИдентификаторОтчета, Результат) Экспорт
	
	Возврат;
	
КонецПроцедуры

Функция ПодготовитьОтчет(ПараметрыОтчета) Экспорт
	
	Перем ДанныеРасшифровкиОбъект;
	
	Результат = Новый ТабличныйДокумент;
	
	РезультатФормированияОтчета = Новый Структура;
	РезультатФормированияОтчета.Вставить("Выполнено",         Истина);
	РезультатФормированияОтчета.Вставить("Результат",         Результат);
	РезультатФормированияОтчета.Вставить("ДанныеРасшифровки", ПараметрыОтчета.ДанныеРасшифровки);
	РезультатФормированияОтчета.Вставить("КонтрольноеСоотношениеИтоговВыполняется", Истина);
	РезультатФормированияОтчета.Вставить("КраткоеПредставлениеОшибки",   "");
	РезультатФормированияОтчета.Вставить("ПодробноеПредставлениеОшибки", "");
	
	МенеджерОтчета = Отчеты[ПараметрыОтчета.ИдентификаторОтчета];
	
	ПараметрыИсполненияОтчета = СервисСверкиРасчетовУНФ.ПолучитьПараметрыИсполненияОтчета(ПараметрыОтчета, МенеджерОтчета);
	
	Если ПараметрыИсполненияОтчета.ИнициализацияВПривилегированномРежиме Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыОтчета.СхемаКомпоновкиДанных) = Тип("Строка") Тогда
		Если ЭтоАдресВременногоХранилища(ПараметрыОтчета.СхемаКомпоновкиДанных) Тогда
			СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(ПараметрыОтчета.СхемаКомпоновкиДанных);
		КонецЕсли;
	Иначе
		СхемаКомпоновкиДанных = ПараметрыОтчета.СхемаКомпоновкиДанных;
	КонецЕсли;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(ПараметрыОтчета.НастройкиКомпоновкиДанных);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	Если ПараметрыИсполненияОтчета.ИспользоватьПередКомпоновкойМакета Тогда
		МенеджерОтчета.ПередКомпоновкойМакета(ПараметрыОтчета, СхемаКомпоновкиДанных, КомпоновщикНастроек);
	КонецЕсли;
	
	КомпоновщикНастроек.Восстановить();
	
	НастройкиДляКомпоновкиМакета = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Сгенерируем макет компоновки данных при помощи компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	Попытка
		
		// В качестве схемы компоновки будет выступать схема самого отчета.
		// В качестве настроек отчета - текущие настройки отчета.
		// Данные расшифровки будем помещать в ДанныеРасшифровки.
		Если ПараметрыИсполненияОтчета.ИспользоватьДанныеРасшифровки Тогда 
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиДляКомпоновкиМакета, ДанныеРасшифровкиОбъект);
		Иначе
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиДляКомпоновкиМакета);
		КонецЕсли;
		
		// Вызываем событие отчета
		Если ПараметрыИсполненияОтчета.ИспользоватьПослеКомпоновкиМакета Тогда
			МенеджерОтчета.ПослеКомпоновкиМакета(ПараметрыОтчета, МакетКомпоновки);
		КонецЕсли;

		Если ПараметрыИсполненияОтчета.ИспользоватьВнешниеНаборыДанных Тогда
			ВнешниеНаборыДанных = МенеджерОтчета.ПолучитьВнешниеНаборыДанных(ПараметрыОтчета, МакетКомпоновки);
		КонецЕсли;
	
		// Создадим и инициализируем процессор компоновки
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		Если ВнешниеНаборыДанных = Неопределено Тогда
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровкиОбъект, Истина);
		Иначе
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровкиОбъект, Истина);
		КонецЕсли;	
		
		// Создадим и инициализируем процессор вывода результата
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(Результат);
		
		// Перед началом вывода проверим, нужен ли привилегированный режим
		ПредыдущееЗначениеПривилегированногоРежима = Неопределено;
		Если Не ПривилегированныйРежим() И ПараметрыИсполненияОтчета.ИспользоватьПривилегированныйРежим Тогда
			ПредыдущееЗначениеПривилегированногоРежима = Ложь;
			УстановитьПривилегированныйРежим(Истина);
		ИначеЕсли ПривилегированныйРежим() И Не ПараметрыИсполненияОтчета.ИспользоватьПривилегированныйРежим Тогда 
			ПредыдущееЗначениеПривилегированногоРежима = Истина;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	
		// Обозначим начало вывода
		ПроцессорВывода.НачатьВывод();
		
		Если ПараметрыИсполненияОтчета.ИспользоватьПередВыводомЭлементаРезультата Тогда
			// Основной цикл вывода отчета
			ЭлементРезультата = ПроцессорКомпоновки.Следующий();
			Пока ЭлементРезультата <> Неопределено Цикл
				
				ПропуститьЭлемент = Ложь;
				МенеджерОтчета.ПередВыводомЭлементаРезультата(
					ПараметрыОтчета,
					МакетКомпоновки,
					ДанныеРасшифровкиОбъект,
					ЭлементРезультата,
					ПропуститьЭлемент);
				
				Если Не ПропуститьЭлемент Тогда // Элемент получен, выведем его при помощи процессора вывода.
					ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
				КонецЕсли;	

				// Получим следующий элемент результата компоновки.
				ЭлементРезультата = ПроцессорКомпоновки.Следующий();
				
			КонецЦикла;
			
			// Завершение вывода отчета
			ПроцессорВывода.ЗакончитьВывод();

		Иначе

			ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);

		КонецЕсли;
		
		// Проверим, нет ли очевидных расхождений в общих итогах, вызванных повреждением информационной базы.
		Если ПараметрыИсполненияОтчета.ПроверкаИтогов Тогда
			МенеджерОтчета.ПроверитьКорректностьИтогов(ПараметрыОтчета, Результат);
		КонецЕсли;
		
		// После окончания процессором вывода отчета, поместим расшифровку во временное хранилище.
		ДанныеДляРасшифровки = Новый Структура("Объект, ДанныеРасшифровки", ПараметрыОтчета, ДанныеРасшифровкиОбъект);
		РезультатФормированияОтчета.ДанныеРасшифровки = ПоместитьВоВременноеХранилище(
			ДанныеДляРасшифровки, РезультатФормированияОтчета.ДанныеРасшифровки);
		
		// Возвращаем предыдущее значение привилегированного режима, если он изменялся.
		Если ПредыдущееЗначениеПривилегированногоРежима <> Неопределено Тогда
			УстановитьПривилегированныйРежим(ПредыдущееЗначениеПривилегированногоРежима);
		КонецЕсли;
		
	Исключение

		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			
		// Записываем в журнал регистрации
		Событие = НСтр("ru = 'Ошибка формирования отчета'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(
			Событие,
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Отчеты[ПараметрыОтчета.ИдентификаторОтчета],
			, // Данных нет
			ПодробноеПредставлениеОшибки);
		
		// Информируем пользователя файловой версии
		Пока ИнформацияОбОшибке.Причина <> Неопределено Цикл
			ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
		КонецЦикла;
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Отчет не сформирован! %1'"), ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		РезультатФормированияОтчета.Выполнено                    = Ложь;
		РезультатФормированияОтчета.КраткоеПредставлениеОшибки   = ТекстСообщения;
		РезультатФормированияОтчета.ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки;
		
		Возврат РезультатФормированияОтчета;

	КонецПопытки;

	МенеджерОтчета.ПослеВыводаРезультата(ПараметрыОтчета, Результат);
	
	Возврат РезультатФормированияОтчета;
	
КонецФункции

// Ищет контрагента, имеющего заданные ИНН и КПП
//
// Параметры:
//  РеквизитыКонтрагента - Структура - поиск контрагента будет осуществлен, если структура содержит свойство "ИНН",
//                        так же может содержать необязательное свойство "КПП"
//
// Возвращаемое значение:
//  СправочникСсылка.Контрагенты - ссылка на найденного контрагента. Если контрагент с заданными ИНН и КПП не найден
//                                 возвращает пустую ссылку
//
Функция НайтиКонтрагентаПоИНН_КПП(РеквизитыКонтрагента) Экспорт
	
	НайденныйКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	ИНН = Неопределено;
	
	Если Не РеквизитыКонтрагента.Свойство("ИНН", ИНН) Или Не ЗначениеЗаполнено(ИНН) Тогда
		Возврат НайденныйКонтрагент;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН И Контрагенты.КПП = &КПП";
	
	КПП = Неопределено;
	Если Не РеквизитыКонтрагента.Свойство("КПП", КПП) Тогда
		КПП = "";
	КонецЕсли;
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		НайденныйКонтрагент = Выборка.Ссылка;
	КонецЕсли;
		
	Возврат НайденныйКонтрагент;
	
КонецФункции

Функция ПолучитьПараметрыРасшифровкиОтчета(Адрес, Расшифровка) Экспорт
	
	ПараметрыРасшифровки = Новый Структура;
	ДанныеОбъекта = ПолучитьИзВременногоХранилища(Адрес);
	ДанныеРасшифровки = ДанныеОбъекта.ДанныеРасшифровки;
	ПоляРасшифровки = ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля();
	Если ПоляРасшифровки.Количество() > 0 И ЗначениеЗаполнено(ПоляРасшифровки[0].Значение) Тогда
		ПараметрыРасшифровки.Вставить("ОткрытьОбъект", Истина);
		ПараметрыРасшифровки.Вставить("Значение", ПоляРасшифровки[0].Значение);
	КонецЕсли;
	
	Возврат ПараметрыРасшифровки;

КонецФункции

#КонецОбласти
